[{"title":"基于B/S架构的CSSA网站的开发","date":"2017-03-16T15:59:59.000Z","path":"2017/03/16/report/","text":"一、研究背景及意义1.Chinese Students and Scholars Association 中国学生学者联合会。由于海外留学生与境外学者人数的增多，世界各地都有成立地方性的CSSA，是以促进学生学者交流及活动为目的的非盈利性、非政治性、综合性组织。旨在提高学生学者的学习生活质量，推广中国传统文化，促进中英学术和文化交流，为中国学生学者提供展示才华和追求梦想的平台，并与当地工作、生活的其他华人华侨以及华人社团保持着长期紧密的合作。 2.联合会缺乏有效的线上管理。各会内部管理工作还存在失序、人员登陆登出紊乱等现象，管理工作纷繁，对于档案信息及活动状况无详细备案，没有科学的管理方式。 3.世界各地联合会由于地域原因而过于分散，会与会之间的沟通交流存在障碍，当下网络时代需要有更有效的交流方式。 二、国内外现状（一） 针对我国境外各地方CSSA内部管理繁杂与外部交流障碍的境况，进一步加强线上沟通交流，方便统一管理。1.Chinese Students and Scholars Association 中国学生学者联合会。由于海外留学生与境外学者人数的增多，世界各地都有成立地方性的CSSA，是以促进学生学者交流及活动为目的的非盈利性、非政治性、综合性组织。旨在提高学生学者的学习生活质量，推广中国传统文化，促进中英学术和文化交流，为中国学生学者提供展示才华和追求梦想的平台，并与当地工作、生活的其他华人华侨以及华人社团保持着长期紧密的合作。 2.联合会缺乏有效的线上管理。各会内部管理工作还存在失序、人员登陆登出紊乱等现象，管理工作纷繁，对于档案信息及活动状况无详细备案，没有科学的管理方式。 3.世界各地联合会由于地域原因而过于分散，会与会之间的沟通交流存在障碍，当下网络时代需要有更有效的交流方式。（二）加强在线学术交流、弘扬中国学术文化，增强民族认同感，加深国家凝聚力。１、CSSA的职责是以人为本，团结和服务中国学生学者。丰富中国学生学者社交、学术、职业的体验。促进中外文化交流。本次选题的职责就是为CSSA实现其重要职责提供更加方便有效的途径。 ２、组织本国学生学者成立联合会，有利于增强民族认同感。联合会要从物质上、思想上和心理上全方位地为会员提供帮助，在异国他乡的大环境的下，使得中国学生感受到来自家乡的氤氲，增强自信，建立自我意识里的积极肯定，从而增强对国家的认同感。 （一）现状：１、CSSA是面向在境外进修的中国公派和自费的留学人员(本科生，研究生，进修人员，访问学者，高级访问学者及项目交流、合作科研人员) 的群众性组织。成员在其中自我教育，自我管理，自我服务，合法权益受到联合会的维护。留学人员通过开展各项有益的活动，丰富了的生活；增进了留学人员之间的友谊和相互了解，加强团结；留学人员奋发学习，为国服务，同时向外国朋友宣传中华民族的文化历史，促进了中外友好关系。 ２、 CSSA在世界范围内具有极其庞大数量的分会存在，诸多分会间联系松散，分会管理繁杂，会员管理亦是如此。（二）存在的问题：1、管理不便，缺少系统的管理途径与方法，仅仅具有线下管理机制，缺乏在线动态边界管理。2、消息传达的不及时。当活动公告内容更新不能及时发布到各会员手中时，他们往往忽视此次活动。 3、在线交流障碍。作为群众型组织，联合会会员往往不常见 面，尤其是在如此网络环境下，学生学者更加注重在线平台的交流， 而不仅仅是线下的一些活动。 三、主要研究内容CSSA门户网站的开发主要实现：1.友好的首页设计： 使用WebGL技术通过threeJS和openstreetmap来3D建模 类似谷歌地球的用户体验 2.个人用户的操作： 登陆注册（填写基本信息） 查询联合会（展示联合会公开信息） 加入联合会（填写详细信息） 3.联合会会员的操作： 退出联合会、包含个人用户操作、活动报名、接收会内公告 对会内活动和公告进行留言评论 4.联合会管理员操作： 管理会员、发布活动、管理活动参与人员、发布公告 管理留言评论 5.系统管理员操作 最高权限操作、数据库更新、页面更新、网站维护 权限管理、抓取已存在CSSA页面信息与链接 6.后台数据库设计 测试实验阶段采用关系型数据库（轻量级的MySQL） 用户信息库、页面内容库、查询信息摘要库、抓取信息库 操作记录库、留言评论库、回收库（都具备良好的关系模型） 四、可行性分析 资源可行性 人力资源：精通web前后端开发的工程师和系统分析师 软件资源：服务器平台 linux;客户端平台 浏览器。 时间资源：预计项目开发、研究，与产品测试所需时间为两个月 经济可行性 基础投资： 房屋和办公设施 计算机软/硬件设备 安全与保密协议 直接投资： 开发维护工资成本 建设费、租金、维护费 技术可行性 关键技术 多JS框架结合 后台django 开源接口 辅助 社会可行性 法律可行性：该产品没有侵权或者抄袭等违法情况，也没有被申请过专利，故可行。 政策可行性：无国家政策限制，也无地方政府（或其它机构）的限制，故可行。 使用可行性：对于服务端的操作人员，由于软件设计的提供给操作人员的接口仅仅会涉及到简单的文件新建、修改、复制、删除等操作，因此仅仅需要操作人员熟悉简单的电脑操作即可，不需要专门进行培训。 该产品操作简单快捷，功能大部分齐全，可以满足用户的基本需求，而且通俗易学。该产品不影响公司工作制度，故可以使用该产品。 五、功能需求分析 总体分析 管理功能 网站搜索功能 联合会功能 会员登录注册功能 评论/留言功能 功能分析 管理功能 人员管理 从属人员的增、删、改 分会管理 总会对分会的操作 权限管理 高级权限对低级权限的管理 系统设置 联合会 信息编辑 资料整理 公告发布 统计报表 会员信息整理 联合会数据统计 网站搜索功能 按地域搜索 列出当地联合会 按名称搜索 列出指定或类似联合会 按内容搜索 列出相关内容 关键词搜索 列出相关内容 联合会功能 组织资料 组织成员资料 组织对内/外消息 组织人员权限 会员登录注册功能 个人资料：用户名、密码、邮箱、联系方式、个人介绍等基本信息 联合会相关：接收组织消息，查看组织情况等 我的留言/评论：对自己留言/评论的查看、删除管理 评论/留言功能 版主对留言管理 楼主对评论管理 六、系统设计原则系统设计总原则为确保系统的建设成功与可持续发展，在系统的建设与技术方案设计时我们遵循如下的原则： 1、统一设计原则统筹规划和统一设计系统结构。尤其是应用系统建设结构、数据模型结构、数据存储结构以及系统扩展规划等内容，均需从全局出发、从长远的角度考虑。2、先进性原则系统构成必须采用成熟、具有国内先进水平，并符合国际发展趋势的技术、软件产品和设备。在设计过程中充分依照国际上的规范、标准，借鉴国内外目前成熟的主流网络和综合信息系统的体系结构，以保证系统具有较长的生命力和扩展能力。保证先进性的同时还要保证技术的稳定、安全性。3、高可靠/高安全性原则系统设计和数据架构设计中充分考虑系统的安全和可靠。4、标准化原则系统各项技术遵循国际标准、国家标准、行业和相关规范。5、成熟性原则系统要采用国际主流、成熟的体系架构来构建，实现跨平台的应用。6、适用性原则保护已有资源，急用先行，在满足应用需求的前提下，尽量降低建设成本。7、可扩展性原则信息系统设计要考虑到业务未来发展的需要，尽可能设计得简明，降低各功能模块耦合度，并充分考虑兼容性。系统能够支持对多种格式数据的存储。 业务应用支撑平台设计原则业务应用支撑平台的设计遵循了以下原则： 1、遵循相关规范或标准遵循J2EE、XML、JDBC、EJB、SNMP、HTTP、TCP/IP、SSL等业界主流标准2、采用先进和成熟的技术系统采用三层体系结构，使用XML规范作为信息交互的标准，充分吸收国际厂商的先进经验，并且采用先进、成熟的软硬件支撑平台及相关标准作为系统的基础。3、可灵活的与其他系统集成系统采用基于工业标准的技术，方便与其他系统的集成。4、快速开发/快速修改的原则系统提供了灵活的二次开发手段，在面向组件的应用框架上，能够在不影响系统情况下快速开发新业务、增加新功能，同时提供方便地对业务进行修改和动态加载的支持，保障应用系统应能够方便支持集中的版本控制与升级管理。5、具有良好的可扩展性系统能够支持硬件、系统软件、应用软件多个层面的可扩展性，能够实现快速开发/重组、业务参数配置、业务功能二次开发等多个方面使得系统可以支持未来不断变化的特征。6、平台无关性系统能够适应多种主流主机平台、数据库平台、中间件平台，具有较强的跨系统平台的能力。7、安全性和可靠性系统能保证数据安全一致，高度可靠，应提供多种检查和处理手段，保证系统的准确性。针对主机、数据库、网络、应用等各层次制定相应的安全策略和可靠性策略保障系统的安全性和可靠性。8、用户操作方便的原则系统提供统一的界面风格，可为每个用户群，包括客户，提供一个一致的、个性化定制的和易于使用的操作界面。9、应支持多CPU的SMP对称多处理结构 七、系统模块设计 数据字典 数据项 会员代码 MemberID char(6) 组织代码 OrganizationID char(4) 消息代码 InfomationID char(12) 组织管理员代码 OManagerID char(8) 系统管理员代码 SManagerID char(8) 普通用户编号 UserID char(8) 类别编号 TypeID char(6) 开始时间 StartDate dateTime(8) 结束时间 StopDate dateTime(8) …etc 数据结构 联合会信息 组成：组织介绍、组织公告、成员、公开活动、所在地 个人信息 组成：用户名、密码、权限、资料 活动 组成：发起会、发起人、发起/截至时间、发起地点、参与人、发起内容 会员申请信息：组成：个人信息、目的组织、目的组织管理员 登录：用户名、密码、图灵验证 注册：用户名、密码、简介、验证 …etc 数据流 会员申请：数据来源：个人用户 数据流向：组织管理员 数据结构：会员申请信息 发布活动：数据来源：联合会/组织管理员 数据流向：从属会员 数据结构 活动 用户登录/注册：数据源：客户端 数据流向：用户信息表 数据结构：登录/注册 …etc 数据存储 用户信息表：组成：用户名、密码、联系方式、所属组织、权限… 评论/留言表：组成：留言版属、留言人、留言时间、留言内容… 组织信息表：组织信息、公告、管理员、活动… …etc 处理过程 见流图 外部实体 省略 数据流图 用户登录注册 图1 活动发布 图2八、系统各模块功能 登录模块：用户信息验证 注册模块：信息验证、信息录入 注册联合会模块：验证、信息录入 联合会管理模块：信息编辑、公告修改、活动发布、会员管理 申请入会模块：提交申请、申请审核、同意则录入 活动发布模块：活动提交、审核、通过则确认发布向权限内受众 会员管理模块：人员增删改、审核处理、权限操作 …etc九、数据库设计 概念模型设计(E-R图) 图3 数据库分析 实验暂用轻量级关系型数据库 mysql 处理高并发或尝试使用NoSQL(no relational)型数据库 数据库表设计用户信息表 字段名 名称 用户名 User_ID 密码 PsW 联系方式 Contact 个人介绍 User_Info 所属组织 Organization_ID 联合会信息表 字段名 名称 组织名 Organization_ID 组织介绍 Organization_Info 地址 OAddress 管理员 OManager_ID 会员数目 MemberCount 活动表 字段名 名称 活动名 Activity_ID 活动地址 Activity_Add 活动内容 Activity_Cont 发起人 OManager_ID 所属组织 Organization_ID 留言评论表 字段名 名称 留言编号 Word_ID 留言内容 Word_Cont 留言位置 Word_Add 留言人 User_ID 留言时间 Word_DateTime","tags":[{"name":"开题报告,需求分析","slug":"开题报告-需求分析","permalink":"http://yoursite.com/tags/开题报告-需求分析/"}]},{"title":"小小说","date":"2017-03-15T13:54:27.000Z","path":"2017/03/15/novel1/","text":"尊严死聂鑫森一 辆白色的小车，驶出了湘楚大学的校门。深秋上午的太阳光薄而淡，透出一阵阵的凉意。从这里到江南医院，要穿过繁华的闹市，加上红绿灯，堵车，满打满算要一个小时。 开车的是程奋，坐在后座的是郑波。 程奋在校办公室当主任，四十八岁，头圆、腹凸、体胖。郑波比他大两岁，是中文系的教授，戴一副深度近视眼镜，主攻古代文字学，师从程奋的父亲程笃，读硕读博，再当助手，一眨眼过去了二十多年。两个人久久不说话，在去向医院的这一路上静得只听见车轮摩擦水泥路发出的沙沙声。古稀之年的程笃肝癌晚期，四个月前住进了江南医院的肿瘤科重症监护室。郑波在上课、开会之余，一个人去得很勤。重症监护室是不能随便让人进去探看的，因为里面的空气消了毒。门上只有一个玻璃镶嵌的小孔，郑波隔一阵就会把眼睛贴上去，打量躺在病床上的程笃：一头银发，满脸愁苦，时而清醒，时而昏迷；鼻子的两孔插着氧气管和胃管，胳膊上插着输液的套管，下面还插着输尿管。 每当这个时候，郑波就会喟然长叹。这种“生命支持系统”，无非是让先生毫无质量地活在限定的时间里，死已是不可避免的了。先生平日曾多次对他说：“人活着，要有尊严，人死去，也要有尊严。”这种比“死别”更残忍的“生离”，身上插着管子，身边没有亲人朋友，像吞币机一样耗费钱财，“工业化”地死去，先生一定是极不愿意的。可惜师母因病已去世多年，可惜程奋夫妇和儿子都太忙，来得少，来了也总是匆匆的。 郑波读本科时，程笃第一次上“文字学”的课，自我介绍说：“我姓程名笃，字顿迟，你们可知道这名和字，来自何书？”郑波站起来说：“来自《说文解字》，笃者，‘马行顿迟’。”程笃眼睛一亮，大声说：“你读书多，记性好，孺子可教！”尔后，郑波本科毕业，再读程笃的硕士和博士，因成绩突出，发表多篇论文，也就留校教书，并当了先生的助手。 在郑波看来，程笃于他是亦师亦父，而程笃也视郑波亦友亦子，不但学问上对郑波谆谆引导，生活上也极为关心。郑波的妻子，就是先生和师母介绍相识并喜结连理的。先生最大的遗憾，是儿子程奋读了硕士以后，改行去搞行政，而且干得津津有味。他对郑波说：“在知识界，第一等做学问，第二等教书，第三等做官。程奋没有定力，只能如此了。” 正在开车的程奋，鸣了一声笛，问道：“郑波兄，睡着了？” “没有。我在想先生，他太痛苦了。” “是呵……是呵。早几天大夫找我面谈过一次。” 郑波装作一无所知，问：“谈什么呢？” “他说……老人肯定没有希望了，家属是否可以考虑停止治疗。我问怎么个停止治疗法？他说，由家属签了字，再在医生指导下拔掉输氧管。” “你怎么说？” “我明白之所以要这样做，是避免医患纠纷，一切都是家属自愿的。但……我不同意！” “是只要先生活着，你就可以照领他的工资？” “绝对不是，那是人性丧尽！我、妻子、儿子，担不起这大不孝的名声，领导、长辈、同事、学生会怎么看我们？今后还怎么做人做事？” “你担心将来副校长提拔不上？担心儿子将来不好找对象？就不担心老爷子这么受罪！唉！” “郑波兄，我猜想大夫也和你谈过了，你是做学问的，没什么顾忌，能不能想个两全其美的法子？” 郑波一惊，随即平静下来，说：“程奋弟，我知道你想说又不好开口，大夫和我谈话后，想得我坐卧不宁，最后才想明白，为了先生尊严地逝去，由我来代替家属……签字和拔掉管子吧。”他的喉头哽咽起来，泪水奔涌而出。 程奋小声说：“谢谢……谢谢……” 程笃安然辞世，然后是火化、开追悼会、入土。 不断地有人向程奋和郑波，询问程笃最后的死因。 由郑波签字的医院、家属共拟的协议书复印件，程奋时刻揣在口袋里，有人问即掏出来说：“一切都由郑师兄做主，我听他的。” 郑波则从容如昔，有人来和气地询问或愤怒地责问，他面不改色心不跳，平静地说：“是我签的字，是我拔的管子。”","tags":[{"name":"小说","slug":"小说","permalink":"http://yoursite.com/tags/小说/"}]},{"title":"Hexo Problems","date":"2017-03-14T13:54:27.000Z","path":"2017/03/14/Hexo-Problems/","text":"if you deploy hexosome questions appearyou can search you hexo root directory(ls -a) for .git / .deploy_git delete themand then sudo hexo d -g again . just like restart computer . memorandum cluase for myself ./start.sh . ./path.sh ./edit.sh ./rmarticle.sh","tags":[{"name":"hexo build","slug":"hexo-build","permalink":"http://yoursite.com/tags/hexo-build/"}]}]